---
title: 进程和线程
date: 2022-11-19 20:42:28
tags:
categories:
- win内核
password: 进程和线程
abstract: 这里有东西被加密了，需要输入密码查看哦。
message: 这里需要密码才能访问。
---



# 1.KPCR结构

CPU控制块结构，每一个逻辑核都有一个KPCR结构描述当前CPU的各种信息。全局变量“KeNumberProcessors”中保存了当前机器的CPU核数。

 

在系统调用章节我们初步了解了KPCR的部分成员。

 

KPCR结构成员列表：

```c
//0x3748 bytes (sizeof)
struct _KPCR
{
    union
    {
        struct _NT_TIB NtTib;                                               //0x0
        struct
        {
            struct _EXCEPTION_REGISTRATION_RECORD* Used_ExceptionList;      //0x0
            VOID* Used_StackBase;                                           //0x4
            VOID* Spare2;                                                   //0x8
            VOID* TssCopy;                                                  //0xc
            ULONG ContextSwitches;                                          //0x10
            ULONG SetMemberCopy;                                            //0x14
            VOID* Used_Self;                                                //0x18
        };
    };
    struct _KPCR* SelfPcr;                                                  //0x1c
    struct _KPRCB* Prcb;                                                    //0x20
    UCHAR Irql;                                                             //0x24
    ULONG IRR;                                                              //0x28
    ULONG IrrActive;                                                        //0x2c

            UCHAR ResourceIndex;                                            //0x195
        };
        struct
        {
            UCHAR SuspendApcFill1[3];                                       //0x194
            UCHAR QuantumReset;                                             //0x197
        };
        struct
        {
            UCHAR SuspendApcFill2[4];                                       //0x194
            ULONG KernelTime;                                               //0x198
        };
        struct
        {
            UCHAR SuspendApcFill3[36];                                      //0x194
            struct _KPRCB* volatile WaitPrcb;                               //0x1b8
        };
        struct
        {
            UCHAR SuspendApcFill4[40];                                      //0x194
            VOID* LegoData;                                                 //0x1bc
        };
        struct
        {
            UCHAR SuspendApcFill5[47];                                      //0x194
            UCHAR LargeStack;                                               //0x1c3
        };
    };
    ULONG UserTime;                                                         //0x1c4
    union
    {
        struct _KSEMAPHORE SuspendSemaphore;                                //0x1c8
        UCHAR SuspendSemaphorefill[20];                                     //0x1c8
    };
    ULONG SListFaultCount;                                                  //0x1dc
    struct _LIST_ENTRY ThreadListEntry;                                     //0x1e0
    struct _LIST_ENTRY MutantListHead;                                      //0x1e8
    VOID* SListFaultAddress;                                                //0x1f0
    struct _KTHREAD_COUNTERS* ThreadCounters;                               //0x1f4
    struct _XSTATE_SAVE* XStateSave;                                        //0x1f8
};
```

- +0 Header：可等待对象头部。
- +28 InitialStack：线程切换相关。当前线程的栈底。栈底-29C是TrapFrame结构首地址。
- +2C StackLimit：线程切换相关。当前线程的最大栈顶。ESP不能小于这个值。
- +30 KernelStack：线程切换相关。线程切换时，存储当前线程切换时的ESP，被切换回来时，从这里恢复ESP。
- +39 Running：线程状态，正在运行中为1，否则为0。
- +3A Alerted：可警惕性。APC相关，后续APC章节学习。
- +3C MiscFlags：
  - KernelStackResident：堆栈可扩展位。为1时，线程内核堆栈可以被扩大。0时无法扩大。
  - SystemThread：为1时，该线程为内核线程，否则为用户线程。
- +40 ApcState：APC相关，后续APC章节学习。
- +57 Priority：当前线程的优先级。如存储11，则优先级为11，当前线程存储在第11个就绪链表中。优先级数字越大，优先级越低。默认线程优先级为8，存储在第8个就绪链表中。
- +60 ApcQueueLock：APC相关，后续APC章节学习。
- +64 ContextSwitches：当前线程切换了多少次。
- +68 State：线程状态。就绪、等待、运行等。
- +88 Teb：3环的TEB。
- +BC ServiceTable：系统服务表地址，系统调用章节已学过。
- +C0 WaitBlock：当前线程正在等待的对象。
- +128 TrapFrame：TrapFrame结构，进0环时保存3环寄存器的值，系统调用章节已学过。
- +135 BasePriority：线程基础优先级。这个值就是所属进程的BasePriority值。
- +13A PreviousMode：先前模式。一些内核函数会判断这个值。
- +150 Process：该线程的父进程（创建该线程的进程）。
- +168 ApcStatePointer：APC相关，后续APC章节学习。
- +170 SavedApcState：APC相关，后续APC章节学习。
- +18C Win32Thread：win32线程，如果该线程是UI图形线程，就会多一个win32线程结构体。
- +1E0 ThreadListEntry：当前进程所有线程的双向链表。

# 4.OBJECT_HEADER

每一个内核对象都有一个OBJECT_HEADER结构，大小为0x18。将某个内核对象地址-0x18就是OBJECT_HEADER结构地址。

 

OBJECT_HEADER结构成员列表：

```
nt!_OBJECT_HEADER
   +0x000 PointerCount     : Int4B
   +0x004 HandleCount      : Int4B
   +0x004 NextToFree       : Ptr32 Void
   +0x008 Lock             : _EX_PUSH_LOCK
   +0x00c TypeIndex        : UChar
   +0x00d TraceFlags       : UChar
   +0x00e InfoMask         : UChar
   +0x00f Flags            : UChar
   +0x010 ObjectCreateInfo : Ptr32 _OBJECT_CREATE_INFORMATION
   +0x010 QuotaBlockCharged : Ptr32 Void
   +0x014 SecurityDescriptor : Ptr32 Void
   +0x018 Body             : _QUAD
```

- PointerCount：对应的内核对象被使用了多少次。如调用ObXXXX函数都会将该值+1。该值为0时，对应的内核对象就会被释放。
- HandleCount：句柄引用。
- TypeIndex：对应的内核对象的类型。
- Flags：详细作用未知。当此处的值被置为4时（对应的对象为进程对象时），对应的进程被保护，无法打开、附加。且不影响进程功能。仅对3环起作用。

# 5.线程链表

线程大体上可分为3种状态：等待、正在运行、就绪。系统上的所有未处于正在运行状态的线程都被存储在两种链表中：等待链表+就绪链表。

## 等待链表

全局变量KiWaitListHead是一个双向链表的头部，里面是所有等待执行的线程的ETHREAD结构，每个核都有一个等待链表。链表中每个节点指向ETHREAD中的KTHREAD->WaitListEntry。

 

当调用Sleep、WaitForSingleObject一类的等待函数时，该线程会被加入到这个链表中。

## 就绪链表（调度链表）

所有就绪的线程都会存储在就绪链表中，共有32个就绪链表（32位），所有核共享这32个链表，每个链表对应一个优先级（0~31）。全局变量KiDispatcherReadyListHead存储了这32个链表的起始位置。

## 扩展：进程、线程遍历

操作系统中所有的线程 = 所有核中等待链表中的所有线程 + 32个就绪链表中所有线程 + 所有核的KPCR中正在运行的线程。

 

而通过遍历线程可以找到每个线程所属的进程。即使断链也无法阻挡这种遍历。

# 6.线程切换-模拟版

在逆向windows线程切换逻辑之前，先自己写一个模拟的线程切换代码，感受下线程切换的大体思路。

 

滴水模拟线程切换源码：https://wwi.lanzoui.com/iKbe0vdd95g

 

首先初始化四个线程。然后观察初始化函数RegisterGMThread。

![](进程和线程/4.png)

## RegisterGMThread

代码中定义了一个线程池，是一个全局数组变量，每个元素都是自定义的线程结构体。



![](进程和线程/5.png)

![](进程和线程/6.png)



